src/Catalogs/КонтактнаяИнформация.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Catalog>
		<Properties>
			<Name>КонтактнаяИнформация</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Представление</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Клиенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Тип</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыКонтактнойИнформации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Поле1</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Поле2</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Поле3</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Поле4</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Поле5</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Поле6</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Поле7</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Поле8</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Поле9</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Поле10</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗначениеПоУмолчанию</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолеХраненияНомера</Name>
					<Comment>преобразованный для поиска телефонный номер</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Районы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеУчаствуетВРассылках</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/Catalogs/КонтактнаяИнформация/Forms/ФормаСписка/module.bsl
Процедура СформироватьЗаголовокОкна()

	ПредставлениеОбъекта = "";
	Если ТипЗнч(Отбор.Объект.Значение) = Тип("СписокЗначений") Тогда
		Если Отбор.Объект.ВидСравнения = ВидСравнения.ВСписке ИЛИ Отбор.Объект.ВидСравнения = ВидСравнения.ВСпискеПоИерархии Тогда
			ПредставлениеОбъекта = "в списке ";
		ИначеЕсли Отбор.Объект.ВидСравнения = ВидСравнения.НеВСписке ИЛИ Отбор.Объект.ВидСравнения = ВидСравнения.НеВСпискеПоИерархии Тогда
			ПредставлениеОбъекта = "не в списке ";
		КонецЕсли;
		ПредставлениеСписка = "";
		Для каждого ЭлементСписка Из Отбор.Объект.Значение Цикл
			Если Не ПустаяСтрока(ПредставлениеСписка) Тогда
				ПредставлениеСписка = ПредставлениеСписка + ", ";
			КонецЕсли; 
			ПредставлениеСписка = ПредставлениеСписка + ?(НЕ ЗначениеЗаполнено(ЭлементСписка.Значение), "<...>", Строка(ЭлементСписка.Значение));
		КонецЦикла;
		ПредставлениеОбъекта = ПредставлениеОбъекта + ПредставлениеСписка;
	ИначеЕсли Справочники.ТипВсеСсылки().СодержитТип(ТипЗнч(Отбор.Объект.Значение)) Тогда
		Если НЕ ЗначениеЗаполнено(Отбор.Объект.Значение) Тогда
			ПредставлениеОбъекта = "не определен";
		Иначе
			Если Отбор.Объект.ВидСравнения = ВидСравнения.Равно Тогда
				ПредставлениеОбъекта = "";
			ИначеЕсли Отбор.Объект.ВидСравнения = ВидСравнения.НеРавно Тогда
				ПредставлениеОбъекта = "не равно ";
			КонецЕсли; 
			ПредставлениеОбъекта = ПредставлениеОбъекта + Строка(Отбор.Объект.Значение);
		КонецЕсли; 
	КонецЕсли; 
	
	ЭтаФорма.Заголовок = "Контактная информация. Объект: " + ПредставлениеОбъекта;

КонецПроцедуры

Процедура РегистрСведенийСписокВыбор(Элемент, ВыбраннаяСтрока, Колонка, СтандартнаяОбработка)

	Если ЭтаФорма.РежимВыбора Тогда
		СтандартнаяОбработка = Ложь;
		ЭтаФорма.Закрыть(Элемент.ТекущиеДанные.Представление);
	КонецЕсли; 
	
КонецПроцедуры

Процедура РегистрСведенийСписокПослеУдаления(Элемент)
	
	ОповеститьОЗаписиНовогоОбъекта(Неопределено);
	
КонецПроцедуры

Процедура ПриОткрытии()
	
	Отбор.Объект.Использование = Истина;
	
	
	УправлениеРИБ.ПриОткрытииСпискаСправочника(ЭтаФорма);
	
КонецПроцедуры

Процедура ОбновлениеОтображения()
	
	СформироватьЗаголовокОкна();
	
КонецПроцедуры
